src/cf/InformationRegisters/ЭскалированныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЭскалированныеДействия</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилоЭскалации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаЭскалации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДействиеЭскалации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПравилЭскалацииЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Действия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЭскалированныеДействия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в историю эскалации задач.
//
// Параметры:
//  Действие - ОпределяемыйТип.Действия
//  ИдентификаторУчастника - УникальныйИдентификатор
//  ПравилоЭскалации - СправочникСсылка.ПравилаЭскалацииЗадач - Правило эскалации.
//  ИнформацияОбЭскалации - Структура - Информация об эскалации. См. ЭскалацияЗадач.ИнформацияОбЭскалации().
//
Процедура Добавить(Действие, ИдентификаторУчастника, ПравилоЭскалации, ИнформацияОбЭскалации) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Действие = Действие;
	МенеджерЗаписи.ИдентификаторУчастника = ИдентификаторУчастника;
	МенеджерЗаписи.ПравилоЭскалации = ПравилоЭскалации;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ИнформацияОбЭскалации);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает сведения об участниках действия.
// Параметры:
//	Действие - ОпределяемыйТип.Действия - Ссылка на действие, по которому необходимо получить сведения.
//	ИдентификаторУчастника - УникальныйИдентификатор
//	
// Возращаемое значение:
//	Соответствие, в ключе которого содержится идентификатор участника, а в значении - структура со сведениями о данном участнике.
//
Функция ПолучитьСведения(Действие, ИдентификаторУчастника) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ 
		|	ЭскалированныеДействия.ПравилоЭскалации КАК ПравилоЭскалации
		|ИЗ
		|	РегистрСведений.ЭскалированныеДействия КАК ЭскалированныеДействия
		|ГДЕ
		|	ЭскалированныеДействия.Действие = &Действие
		|	И ЭскалированныеДействия.ИдентификаторУчастника = &ИдентификаторУчастника");
	Запрос.УстановитьПараметр("Действие", Действие);
	Запрос.УстановитьПараметр("ИдентификаторУчастника", ИдентификаторУчастника);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПравилоЭскалации;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Удаляет записи в историю эскалации задач.
//
// Параметры:
//  Действие - ОпределяемыйТип.Действия
//
Процедура УдалитьПоДействию(Действие) Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Действие.Установить(Действие);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
